Revit 2027 API
ParameterTypeId.RebarSystemHookOrientBackDirn1 Property
 "Interior Major Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientBackDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientBackDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientBackDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientBackDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace